{
  "module": "keras.src.models.functional",
  "class_name": "Functional",
  "config": {
    "name": "functional",
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "Lambda",
        "config": {
          "name": "set_global_state",
          "function": {
            "module": "keras.src.backend.common.global_state",
            "class_name": "function",
            "config": "set_global_attribute",
            "registered_name": "function"
          },
          "arguments": {
            "value": false
          }
        },
        "name": "set_global_state",
        "inbound_nodes": [
          {
            "args": [
            ],
            "kwargs": {
              "inputs": "safe_mode_saving"
            }
          }
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Lambda",
        "config": {
          "name": "unsafe_deserialization",
          "function": {
            "module": "keras.models",
            "class_name": "function",
            "config": "load_model",
            "registered_name": "function"
          },
          "arguments": {
            "safe_mode": false
          }
        },
        "build_config": {
          "input_shape": [
            null,
            10
          ]
        },
        "name": "unsafe_deserialization",
        "inbound_nodes": [
          {
            "args": [
            ],
            "kwargs": {
              "inputs": "model.keras"
            }
          }
        ]
      }
    ],
    "input_layers": [
      [
        0,
        0
      ]
    ],
    "output_layers": [
      [
        0,
        0
      ]
    ]
  }
}